[
    {
        "title":"How I got into a top university after coming from a regional university ?",
        "author":"Chaitanya Kuber, University of Michigan Ann Arbor, Tesla",
        "text":"Growing up in Indian society it is so natural for us to believe in cut-offs and merit list culture to get into any university or job. The admission process in India largely works on filtering 1000s of applications based on a rigid pre-defined criterion and then just selecting the ones leftover. Fortunately for all the US aspirants, Universities in the US are open to the students who demonstrate caliber to perform at the highest level. It all comes down to a point of how you make your case in front of the admission committee.\n        The selection committee here focuses on a holistic review of a candidate’s profile before making a decision on his/her case. There are test scores (GRE, IELTS, TOEFL, GMAT, and CGPA) which provide a standard to measure a student's ability. However, in the USA, the Universities look for things beyond exam scores like applicant’s motivation for applying to his/her desired course, future career plans, education and career background, extra-curricular participation, and hobbies. The Statement of Purpose (SoP), Letter of Recommendation (LoR), Resume can help students highlight and market their story which exam scores fail to depict.\n                Making it possible depends on how you utilize resources. This is how I did it!\n        Statement of Purpose: Almost all the top schools are research oriented. It is best to demonstrate what makes you interested in the program. It can be a research lab, one particular professor, industrial collaborations or something else. The challenging part here is to say these things in a way which stand out in 1000s of other applications for years over years. Remember, the acceptance rate for top univ is less than 10%. Looking back, the right thing I did was taking help of seniors or alumni who are already in the universities I am applying. Their inputs come from directly working with professors, interacting with admission committee members and some of them actually work with admission committee as part of their on-campus jobs!!!\n        These inputs were so unique that my own website search of these universities would not have helped. Additionally, I decided to stay away from consultants who guide 50 other students like me because I wanted my application to stand out in the crowd. Know that the reviewers on admission panel are seasoned campaigners and I can rest assure you that they can smell a generic profile (SoP, LoR, Resume) from miles off making an extremely bad first impression.\n        In conclusion, it’s very much possible to get admitted into a top school in the US, irrespective of your background if you take the efforts to not be generic and demonstrate a great fit between you and your University.\n        I plan to write more such articles in the future, Let me know what you would like to know. For those who are preparing for Spring-2019/Fall-2019: Edupitr is a good platform to connect with alumni and get inputs on your application like I did. \n        Good Luck!"
    },
    {
        "title":"Research paper, conferences necessary to get into top schools ?",
        "author":"Chaitanya Kuber, University of Michigan Ann Arbor, Tesla",
        "text":"This was a genuine question when I had started applying. I used to talk to many seniors who have already been there or still trying. In this phase 'International journal', 'Impact factor', 'research internship' were the words which were thrown around as if they were as basic as getting a high school degree.\n        I started calculating my chances. No research experience, forget about paper-conference-journal; where do I stand! I had no answer. Fortunately, I have now!\n        After I got into Univ. of Michigan- Ann Arbor, I looked around. There were students who had two-three journal publications but half the class did not have any prior research or journal publications.\n        I spoke with one of the professor from MIT teaching a course in my university. He said,\" when I look at the applications for MS, a research experience is something good to have but not necessary. It will only demonstrate your research acumen. A more direct measure would be CGPA. Consider: your academics as '1' and research experience as '0'. If you keep research before your academics then you are only '1' for admission committee but if you could keep academics first and your research backs it then you are a perfect '10'. Don't forget this order!\"\n        I plan to write more such articles in the future, Let me know what you would like to know. For those who are preparing for Spring-2019/Fall-2019: Edupitr is a good platform to connect with alumni and get inputs on your application like I did. \n        Good Luck!"
    },
    {
        "title":"Demystifying Ambitious, Moderate, and Safe!!",
        "author":"Rohit Kshirsagar, Purdue University, Apple",
        "text":"Many of us have a decent idea of our Ambitious, Moderate, and Safe universities as per our profile. Yet when those admits starting to roll out we are surprised to receive rejects from Moderate to Safe universities while people with comparable or lesser profiles are getting Ambitious admits.\n        Before coming to the US, I couldn’t reason any of this process myself but fortunately, I do have some insights to share now:\n        1. No. of intake in any university varies each year mainly depending on the no. of current students graduating, no. of Professors retiring, and the university budget for that year. This kind of inside information can be extremely useful especially when applying to top schools as they are very picky about their intakes.\n        2. There are high chances of you getting a reject from your safe universities because 2nd tier universities prefer not to roll out admits to overqualified applicants. They know better profiles will receive better admits and won’t choose them. So they roll out admits to aptly qualified candidates who might actually join their university and fill in their seats.\n        3. Many students submit a generic application to Moderate universities and take them for granted if they have good academics and exam scores. However, the thing to remember is that moderate universities are the ones which get flooded with applications. Not only does any average or below average applicant applies to them but also students with killer profiles aiming for top schools to apply as a backup option. So extra efforts must be taken in this case to tailor your application to stand out amongst tons of applicants.\n        All these useful insights and insider information can be well provided by Alumni’s from the US to help you get ahead of other applicants, and crack your list of Ambitious, Moderate, and Safe universities."
    },
    {
        "title":"Does application consultant really make any difference?",
        "author":"Rohit Kshirsagar, Purdue University, Apple",
        "text":"With a wide range of applicants and growing competition, securing a place at a top school has never been easy. With more would-be “MS” applicants applying for the elite schools, it is getting harder still. Growing competition has lowered the average acceptance rate for the top-10 schools ranked by the Financial Times to fewer than 15 percent, down from 17 percent five years ago. But do consultants really give applicants an advantage or is it better to save the money and seek advice elsewhere?\n        1) Consultant admission services cover the entire application process, from essay reviews to interview coaching. On average each application takes 15-20 hours but some candidates spend more than 50 per week with a consultant, typically between March and June. Many consultants claim to be former admissions officers and MS degree holders. They claim their knowledge of the application process can help candidates gain entry. Consultants make candidates change their story, which differentiates them because it is unique.\n        2) Consultants are considered particularly useful for candidates who are out of touch with the university process and those who need help securing visas. They are also beneficial for those who are time-constrained because they help with the lengthy but important process of school selection. Candidates stand a better chance of being admitted if they can demonstrate their “fit” with a program, a unique story is prized but schools seek those with personalities that fit their underlying DNA, such as a focus on technology and innovation.\n        3) A consultant can add value to an application but could also harm it. Some admissions teams fear that consultants can make applications inauthentic; the negative side of consulting is the homogenization of applicants. At Edupitr, we strive to make applications more authentic by discouraging the grandiose exaggeration of achievements, as we know they will be busted in the review.\n        4) Consultants tend to flaunt their knowledge of the admissions process, having been through it themselves. Their expertise can become stale, however, at Edupitr we leverage most recent alumni network and up to date knowledge to give the applicant an edge over the competition."
    }
]