[
    {
        "name":"Tanmay Jain",
        "imageURL":"",
        "admits":["Georgia Institute of Technology - MS Supply Chain Engineering",
            "Purdue University - MS Industrial Engineering"],
        "feedback":"First of all 'Thank you Edupitr'.\n I was in a deep trouble as managing my job and GRE/ TOEFL and university applications was a tough task. It was mid- November and my SoP was not ready.\n        One of my friend referred me to Edupitr. I went with their 'Sprint' package which prepares you in less than 10 days to submit applications. \n       The university shortlist was to the point. (4 admits out of 8) \n        My SoP was based on the sample SoPs I found online. Edupitr helped me with facts about Purdue, GA tech where I could stand out. \n        My Resume (CV) was completely revamped to match US standards.\n        The main in  Edupitr and any other service is that Edupitr's differencefirst hand experience with universities. \n        Thanks Edupitr! May the force be with you!"
    },
    {
        "name":"Akanksha Singh",
        "imageURL":"",
        "admits":["Carnegie Mellon University - Master of Information Systems Management",
            "Texas A & M University - MS MIS",
            "University of Arizona - MS MIS"],
        "feedback":"Edupitr is amazing. I came across this portal coincidently and I’m really thankful for the “serendipity”. I had no guidance related to the admissions for masters, but these guys have been going out of their way to help resolve all my queries related to the admissions. Whether it be about the college you’re targeting or any additional pre requisites that you can take in order to strengthen your application, Edupiter is there to resolve all your doubts and help channelize your focus. Keep up the good work guys. Cheers to your team"
    },
    {
        "name":"Varsha Gupta",
        "imageURL":"",
        "admits":["Purdue University - MS Chemical Engineering",
            "University of Southern California - MS Chemical Engineering"],
        "feedback":"These guys are super awesome. It was nothing less than a fortunate coincidence to come in contact with them. Their SOP and LOR reviews helped me a lot in making these docs enriching. They go out of their ways to help out people with their docs and any other admission related stuff. They charged almost nothing, and I can bet their service is better than the consultants who charge thousands of bucks just to make everything worse. And the best part about them is that they'd been through the same process, so they know it better than others. I would strongly recommend Edupiter to anyone who is planning for their Masters in the US.Way to go guys!!"
    },
    {
        "name":"Viraj Belekar",
        "imageURL":"",
        "admits":["Iowa State Univeristy - PhD Mechanical Engineering",
            "University of Massachusetts, Amherst - PhD Mechanical Engineering",
        "North Carolina State University - PhD Mechanical Engineering",
        "University of California San Diego - MS in Mechanical Engineering"],
        "feedback":"I was very skeptical on higher-education consulting which goes on in many big cities in India. I could not see any point in mass producing my SoP with 100s of others.\n        I was fortunate to have found Edupitr service during my applications. Especially when this service was very new and accepts limited students to keep their standards high.\n        My requirement was such that I had to score 'financial aid', I wanted admission to direct PhD and I had only three weeks remaining to apply and I had no document ready. \n        I knew my requirements are tough but Edupitr reviewers put me in 'Marathon' plan. We went over my SoP, LoRs and Resume several times. \n       Edupitr has developed a science for a strong application. This is something which will make you stand out.\n        I was admitted to PhD program with financial aid in the university of my research interest. \n        Big thank you !"
    },
    {
        "name":"Swarali Kadakuntla",
        "imageURL":"",
        "admits":["Georgia Institute of Technology - MS Electrical and Computer Engineering",
            "University of Minnesota Twin Cities - MS Electrical and Electronics Engineering",
        "University of Michigan Ann Arbor - MS Electrical and Computer Engineering"],
        "feedback":"Edupitr is a great place for getting your SOP reviewed and the corrections they suggested, made it far better. Getting an admit from Georgia tech is nothing less than a miracle for me and I am grateful to Edupitr in making that happen. I would definitely recommend Edupitr to all my friends. Great job guys. Keep the work going :)"
    },
    {
        "name":"Avadhoot Kadam",
        "imageURL":"",
        "admits":[
            "Purdue University - MS Industrial Engineering",
            "Virginia Tech - MS Industrial Engineering",
            "North Carolina State University - MS Industrial Engineering"
        ],
        "feedback":"Edupitr is an excellent platform for students seeking education abroad. Sitting in India one rarely knows the ground reality and the tips and tricks to get into a dream university. \n        I see this initiative helping students in 3 phases of their journey to seek higher education. The first and the most important phase is shortlisting of colleges, writing SOP etc.  \n        The second is after the admit, where in the student can discuss the courses, professors, funding opportunities etc with the seniors who are already studying in the college or are an Alumni.\n        The last phase is networking after graduation. The students get an awesome opportunity to network with the people/Alumni.This helps in career guidance and development after one has graduated. \n        The key take away from this entire outlay is that one gets to learn from the experiences of the seniors. \n        I would say, Edupitr provides a solid foundation on which one can confidently realize their dreams!!!"
    },
    {
        "name":"Jyoti Kumari",
        "imageURL":"",
        "admits":[
            "Syracuse University - MS Computer Science",
            "University of Cincinnati - ME CS with $11K scholarship",
            "University of Virginia - ME Computer Engineering"
        ],
        "feedback":"These guys r doing an excellent job.\n        They gave me pointers to improve my SOP and it really turned out amazing.\n        I was short on time, and they understood it and were really prompt in their service.\n        Good ppl doing Great job.\n        Kudos to you guys!!!"
    },
    {
        "name":"Vandik Zaveri",
        "imageURL":"",
        "admits":[
            "University of Maryland College Park with Graduate Assistantship of $24K"
        ],
        "feedback":"The guys were super helpful. I wish I found them sooner. Just don't let your success get to your head and you will achieve great success. Bang for Buck: 999+\n        I have already started recommending you to people."
    },
    {
        "name":"Soumya Barikeri",
        "imageURL":"",
        "admits":[
            "University of Illinois at Urbana–Champaign",
            "North Carolina State University",
            "Indiana University Bloomington"
        ],
        "feedback":"Really good guidance on SOP and LOR review. Provided me with comments that were helpful in enriching my SOP. Also, they give you speedy replies. In short, your work gets done effectively."
    }
]